package homework;

public class Main {
    public static void main(String[] args) {
// Дан список строк вида "a:11", "b:22", "a:13".... Необходимо получить Map<String,
// List<Integer>> где ключ это символ, а значение - список цифровых значений соответствующих символу.
//Пример:
//("a:11", "b:22", "a:13", "c:20", "a:10") -> {a=[11, 13, 10], b=[22], c=[20]}
//
//Дан список выплат в виде списка строк: "Jack:1110.00", "Nick:220.50",
// "Jack:1300.20".... Необходимо получить Map<String, Double> где ключ это имя, а значение - сумма выплат.
//Пример:
//("Jack:1110.00", "Nick:220.50", "Jack:1300.20") -> {Nick=220.5, Jack=2410.2}
    }
}
