public class Bring {

    public static void main(String[] args) {
        System.out.println(quadrat(123));

    /*Напишите программу, которая выводит на экран значение переменной типа инт в квадрате (n* n).
    Предварительно обьявите эту переменную и задайте ее значение
     */
    }

    public static int quadrat(int n) {
        return n * n;
    }
}
